# AdjustEndCurtainWallParameterNoCorners Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..AdjustEndCurtainWallParameterNoCorners Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Can't put Corner Mullion at end joined to non-Curtain Wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AdjustEndCurtainWallParameterNoCorners { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AdjustEndCurtainWallParameterNoCorners As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AdjustEndCurtainWallParameterNoCorners {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace